import "@/styles/main.css"
import "@/styles/reset.css"

export default function Feedbacks(): React.JSX.Element {
    const quotes_styles = {
        height: "128px",
        width: "128px"
    }

    return (
            <div className="feedback">
                <div className="feedback_container">
                    <p><svg width={quotes_styles.width} height={quotes_styles.height} viewBox="0 0 31 30" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0_201_10611)"><path d="M27.5989 2.1236H20.1837C18.6485 2.1236 17.403 3.36912 17.403 4.9043V12.3195C17.403 13.8547 18.6485 15.1002 20.1837 15.1002H24.8182V18.8078C24.8182 20.8528 23.1556 22.5155 21.1106 22.5155H20.6472C19.8767 22.5155 19.2568 23.1353 19.2568 23.9058V26.6865C19.2568 27.457 19.8767 28.0769 20.6472 28.0769H21.1106C26.2317 28.0769 30.3796 23.929 30.3796 18.8078V4.9043C30.3796 3.36912 29.1341 2.1236 27.5989 2.1236ZM10.9147 2.1236H3.49946C1.96428 2.1236 0.71875 3.36912 0.71875 4.9043V12.3195C0.71875 13.8547 1.96428 15.1002 3.49946 15.1002H8.13397V18.8078C8.13397 20.8528 6.47134 22.5155 4.42636 22.5155H3.96291C3.19242 22.5155 2.57256 23.1353 2.57256 23.9058V26.6865C2.57256 27.457 3.19242 28.0769 3.96291 28.0769H4.42636C9.5475 28.0769 13.6954 23.929 13.6954 18.8078V4.9043C13.6954 3.36912 12.4499 2.1236 10.9147 2.1236Z" fill="black"/></g><defs><clipPath id="clip0_201_10611"><rect width="29.6609" height="29.6609" fill="white" transform="translate(0.71875 0.269775)"/></clipPath></defs></svg></p>
                    <div className="feedback-container_text">
                        <h1> Антон Антонов</h1>
                        <h2>
                            &quot;Очень удобный и понятный
                            интерфейс, в приложении может
                            легко разобраться даже ребенок&quot;
                        </h2>
                    </div>
                </div>

                <div className="lines">
                    <div id="line-up"></div>
                    <div id="line-down"></div>
                </div>

                <div className="feedback_container">
                    <p><svg width={quotes_styles.width} height={quotes_styles.height} viewBox="0 0 31 30" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0_201_10611)"><path d="M27.5989 2.1236H20.1837C18.6485 2.1236 17.403 3.36912 17.403 4.9043V12.3195C17.403 13.8547 18.6485 15.1002 20.1837 15.1002H24.8182V18.8078C24.8182 20.8528 23.1556 22.5155 21.1106 22.5155H20.6472C19.8767 22.5155 19.2568 23.1353 19.2568 23.9058V26.6865C19.2568 27.457 19.8767 28.0769 20.6472 28.0769H21.1106C26.2317 28.0769 30.3796 23.929 30.3796 18.8078V4.9043C30.3796 3.36912 29.1341 2.1236 27.5989 2.1236ZM10.9147 2.1236H3.49946C1.96428 2.1236 0.71875 3.36912 0.71875 4.9043V12.3195C0.71875 13.8547 1.96428 15.1002 3.49946 15.1002H8.13397V18.8078C8.13397 20.8528 6.47134 22.5155 4.42636 22.5155H3.96291C3.19242 22.5155 2.57256 23.1353 2.57256 23.9058V26.6865C2.57256 27.457 3.19242 28.0769 3.96291 28.0769H4.42636C9.5475 28.0769 13.6954 23.929 13.6954 18.8078V4.9043C13.6954 3.36912 12.4499 2.1236 10.9147 2.1236Z" fill="black"/></g><defs><clipPath id="clip0_201_10611"><rect width="29.6609" height="29.6609" fill="white" transform="translate(0.71875 0.269775)"/></clipPath></defs></svg></p>
                    <div className="feedback-container_text">
                        <h1>Мария Маринова</h1>
                        <h2>
                            &quot;Мы с моими учениками активно
                            используем это приложение,
                            ученики в восторге!&quot;
                        </h2>
                    </div>
                </div>

                <div className="lines">
                    <div id="line-up"></div>
                    <div id="line-down"></div>
                </div>

                <div className="feedback_container">
                    <p><svg width={quotes_styles.width} height={quotes_styles.height} viewBox="0 0 31 30" fill="none" xmlns="http://www.w3.org/2000/svg"><g clipPath="url(#clip0_201_10611)"><path d="M27.5989 2.1236H20.1837C18.6485 2.1236 17.403 3.36912 17.403 4.9043V12.3195C17.403 13.8547 18.6485 15.1002 20.1837 15.1002H24.8182V18.8078C24.8182 20.8528 23.1556 22.5155 21.1106 22.5155H20.6472C19.8767 22.5155 19.2568 23.1353 19.2568 23.9058V26.6865C19.2568 27.457 19.8767 28.0769 20.6472 28.0769H21.1106C26.2317 28.0769 30.3796 23.929 30.3796 18.8078V4.9043C30.3796 3.36912 29.1341 2.1236 27.5989 2.1236ZM10.9147 2.1236H3.49946C1.96428 2.1236 0.71875 3.36912 0.71875 4.9043V12.3195C0.71875 13.8547 1.96428 15.1002 3.49946 15.1002H8.13397V18.8078C8.13397 20.8528 6.47134 22.5155 4.42636 22.5155H3.96291C3.19242 22.5155 2.57256 23.1353 2.57256 23.9058V26.6865C2.57256 27.457 3.19242 28.0769 3.96291 28.0769H4.42636C9.5475 28.0769 13.6954 23.929 13.6954 18.8078V4.9043C13.6954 3.36912 12.4499 2.1236 10.9147 2.1236Z" fill="black"/></g><defs><clipPath id="clip0_201_10611"><rect width="29.6609" height="29.6609" fill="white" transform="translate(0.71875 0.269775)"/></clipPath></defs></svg></p>
                    <div className="feedback-container_text">
                        <h1>Денис Денисов</h1>
                        <h2>
                            &quot;Благодаря этому приложению я
                            сдал экзамен в ВУЗе на пять,
                            спасибо вам!&quot;
                        </h2>
                    </div>
                </div>
            </div>
    )
}
